benchmark_results_replicated/20260803_085536/analysis/rep3/run/go_c200/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.91ms   10.53ms 151.93ms   79.18%
    Req/Sec     3.97k   152.28     4.48k    70.67%
  Latency Distribution
     50%   11.21ms
     75%   18.52ms
     90%   27.61ms
     99%   50.38ms
  947320 requests in 1.00m, 115.64MB read
Requests/sec:  15781.92
Transfer/sec:      1.93MB
P95: 34474
P99: 50384